app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "ff"], ["text", "ff"], ["created_at", "2016-01-19 00:28:24.985801"], ["updated_at", "2016-01-19 00:28:24.985801"]]