app/controllers/comments_controller.rb

  def create
    @article = Article.find(2)
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "ewdsf"], ["body", "dfd"], ["article_id", 2], ["created_at", "2016-01-19 01:40:25.203925"], ["updated_at", "2016-01-19 01:40:25.203925"]]